format long;
D=diag([1,2,3]);
s=rand(3,3);
O=orth(s);

A=O*D*O';


format long;
n=[ 130, 65, 14, 13.5];
m=[ 140, 75, 15, 14];
eps=[10e-12, 10e-11, 10e-10, 10e-9 ,10e-8, 10e-7, 10e-6, 10e-5, 10e-4, 10e-3, 10e-2, 10e-1];
for i=1:4
    D=diag([1,2,3,4,5,6,7,8,9,10,11,12,13,n(i),m(i)]);
    s=rand(15,15);
    O=orth(s);
    A=O'*D*O;
    writematrix(A,'file.txt','WriteMode','append','Delimiter','tab');
end

q=[20:1:100];
w=[30:1:110];
for j=1:1:81
    D=diag([1,2,3,4,5,6,7,8,9,10,11,12,13,q(j),w(j)]);
    s=rand(15,15);
    O=orth(s);
    A=O'*D*O;
    otd(j)=13/q(j);
    writematrix(A,'f.txt','WriteMode','append','Delimiter','tab');
end

iter=[56, 47, 54, 50, 45, 43, 42, 42, 37, 33, 34, 31, 33, 30, 29, 29, 29, 29, 28, 23, 25, 27, 26, 26, 23, 27, 20, 23, 25, 23, 22, 24, 21, 21, 23, 21, 22, 22, 22, 22, 23, 22, 20, 19, 19, 20, 20, 20, 20, 19, 18, 18, 19, 18, 20, 20, 19, 19, 17, 16, 19, 18, 17, 17, 17, 18, 19, 16, 17, 17, 16, 17, 17, 16, 17, 17, 18, 16, 17, 15, 17];
plot(otd,iter);
hold on;

title('Зависимость числа итераций от отделимости собственных чисел');
xlabel('Отделимость');
ylabel('Количество итераций');



result=[15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4];
semilogx(eps,result);
hold on;

result=[21, 20, 18, 17, 15, 14, 13, 11, 10, 8, 7, 5];
semilogx(eps,result);
hold on;

result=[281, 250, 219, 188, 157, 126, 95, 16, 16, 13, 7, 3];
semilogx(eps,result);
hold on;

result=[542, 481, 420, 359, 298, 237, 176, 115, 56, 25, 7, 3];
semilogx(eps,result);
hold on;

title('Зависимость числа итераций от заданной точноти при разной отделимости собственных чисел');
xlabel('Заданная точность');
ylabel('Количество итераций');

legend({'1/10','1/5','9/10','9.99/10'});



